In [43]:
import pandas as pd
import numpy as np
df19= pd.read_csv("C:/Users/asus/Downloads/calendar.csv19.gz")
df18= pd.read_csv("C:/Users/asus/Downloads/calendar.csv18.gz")
df17= pd.read_csv("C:/Users/asus/Downloads/calendar.csv17.gz")

#q- have the regulations the city of amsterdam has put in place been effective in 
#curtailing airbnbs/short term vacation rentals?

#went to calendar data to see if there was more information about bookings and to get 
#a better understanding of if the regulations for max nights a host can list a property
#is actually happening?

In [21]:
pd.set_option('display.max_columns', None)
pd.set_option('max_colwidth', None)

In [39]:
df18.head()

   listing_id        date available   price
0       97221  2019-04-04         t  $65.00
1       97221  2019-04-03         t  $65.00
2       97221  2019-04-02         t  $65.00
3       97221  2019-04-01         t  $65.00
4       97221  2019-03-31         t  $65.00

In [40]:
df18.available.value_counts()

f    5979998
t    1151007
Name: available, dtype: int64

In [23]:
df19.head()
#

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,175989,2019-07-08,f,$150.00,$150.00,3.0,30.0
1,311584,2019-07-08,f,$97.00,$97.00,3.0,30.0
2,311584,2019-07-09,f,$97.00,$97.00,3.0,30.0
3,311584,2019-07-10,f,$97.00,$97.00,3.0,30.0
4,311584,2019-07-11,f,$97.00,$97.00,3.0,30.0

In [49]:
df19.groupby(['listing_id'])[['minimum_nights', 'maximum_nights']].agg(np.median)
# find the possible max nights and see if it matched the regulation of 30 nights the city regulated
#but then some strange things happened....

            minimum_nights  maximum_nights
listing_id
2818                   3.0            15.0
20168                  4.0          1000.0
25428                 14.0            60.0
27886                  2.0           730.0
28871                  2.0          1825.0
...                    ...             ...
36495072               1.0            10.0
36497290               1.0            14.0
36497781               7.0          1125.0
36498483               4.0             7.0
36500242               1.0            12.0

[20337 rows x 2 columns]

In [29]:
notavail= df19.loc[df19['available']== 'f']
notavail
#checked for to see what was booked. Of those bookings to see the max nights

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,175989,2019-07-08,f,$150.00,$150.00,3.0,30.0
1,311584,2019-07-08,f,$97.00,$97.00,3.0,30.0
2,311584,2019-07-09,f,$97.00,$97.00,3.0,30.0
3,311584,2019-07-10,f,$97.00,$97.00,3.0,30.0
4,311584,2019-07-11,f,$97.00,$97.00,3.0,30.0
...,...,...,...,...,...,...,...
7422801,36273642,2020-07-03,f,$60.00,$60.00,1.0,2.0
7422802,36273642,2020-07-04,f,$60.00,$60.00,1.0,2.0
7422803,36273642,2020-07-05,f,$60.00,$60.00,1.0,2.0
7422804,36273642,2020-07-06,f,$60.00,$60.00,1.0,2.0
7422805,36273642,2020-07-07,f,$60.00,$60.00,1.0,2.0

In [54]:
notavail.listing_id.value_counts()

15068256    366
19130306    366
6365794     366
18266554    366
27186389    366
           ...
26724522      1
1864561       1
612698        1
25341350      1
23028356      1
Name: listing_id, Length: 20251, dtype: int64

In [53]:
notavail.loc[notavail['listing_id']== 20168]

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
1097,20168,2019-07-09,f,$140.00,$140.00,1.0,1000.0
1098,20168,2019-07-10,f,$140.00,$140.00,1.0,1000.0
1099,20168,2019-07-11,f,$140.00,$140.00,1.0,1000.0
1100,20168,2019-07-12,f,$124.00,$124.00,1.0,1000.0
1101,20168,2019-07-13,f,$128.00,$128.00,1.0,1000.0
...,...,...,...,...,...,...,...
1457,20168,2020-07-03,f,$80.00,$80.00,4.0,1000.0
1458,20168,2020-07-04,f,$80.00,$80.00,4.0,1000.0
1459,20168,2020-07-05,f,$80.00,$80.00,4.0,1000.0
1460,20168,2020-07-06,f,$80.00,$80.00,4.0,1000.0
1461,20168,2020-07-07,f,$80.00,$80.00,4.0,1000.0

In [50]:
notavail.groupby(['listing_id'])[['minimum_nights', 'maximum_nights']].agg(np.mean)

            minimum_nights  maximum_nights
listing_id
2818              3.000000            15.0
20168             3.213333          1000.0
25428            14.000000            60.0
27886             2.000000           730.0
28871             2.000000          1825.0
...                    ...             ...
36495072          1.000000            10.0
36497290          1.000000            14.0
36497781          7.000000          1125.0
36498483          4.000000             7.0
36500242          1.000000            12.0

[20251 rows x 2 columns]

In [31]:
df19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7423171 entries, 0 to 7423170
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      int64
 1   date            object
 2   available       object
 3   price           object
 4   adjusted_price  object
 5   minimum_nights  float64
 6   maximum_nights  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 396.4+ MB

In [32]:
df19['date'] = df19['date'].astype('datetime64[ns]')

In [33]:
df19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7423171 entries, 0 to 7423170
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      int64
 1   date            datetime64[ns]
 2   available       object
 3   price           object
 4   adjusted_price  object
 5   minimum_nights  float64
 6   maximum_nights  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 396.4+ MB

In [36]:
df19.date.max()

Timestamp('2020-07-07 00:00:00')

In [37]:
df19.date.min()

Timestamp('2019-07-08 00:00:00')

In [41]:
df19.available.value_counts()

f    6315457
t    1107714
Name: available, dtype: int64

In [42]:
df18.available.value_counts()

f    5979998
t    1151007
Name: available, dtype: int64

In [44]:
df17.available.value_counts()

f    4723753
t    1421752
Name: available, dtype: int64

In [45]:
df17.date.min()

'2017-07-03'

In [46]:
df17.date.max()

'2018-07-03'